verification/runs/F14-cooling-ladder/K2b_runs/K2bU_trans/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.orig";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor
    {
        type            noSlip;
    }
    ceiling
    {
        type            noSlip;
    }
    wall_cold
    {
        type            noSlip;
    }
    wall_hot
    {
        type            noSlip;
    }
    rack_top
    {
        type            noSlip;
    }
    tile
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.245;
        value           uniform (0 0 0);
    }
    return
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    rack_in
    {
        type            flowRateOutletVelocity;
        volumetricFlowRate constant 0.35;
        value           uniform (0 0 0);
    }
    rack_out
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.35;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
